#####################################################################################
# Глобальные Константы

BACKGROUND_COLOR, GRAY_COLOR, GRAY_COLOR2, BLACK_COLOR = "#000000", "#606060", "#C0C0C0", "#000000"
WHITE_COLOR, RED_COLOR, GREEN_COLOR, BLUE_COLOR, YELLOW_COLOR = "#FFFFFF", "#FF0000", "#008000", "#0000FF", "#FFFF00"

PARTS_COLOR =    [(255, 255, 255, 255), (30, 30, 30, 255), (150, 150, 150, 255),  # 0 белый 1 черный 2 серый
                  (255, 0, 0, 255), (0, 150, 0, 255), (0, 0, 255, 255),           # 3 красный 4 зеленый 5 синий
                  (255, 255, 0, 255), (128, 0, 128, 255), (0, 128, 128, 255),     # 6 желтый (крас+зел) 7 фиолетовый (кра+син) 8 бирюзовый (зел+син)
                  (250, 150, 0, 255), (100, 200, 250, 255), (250, 120, 190, 255), # 9 оранжевый 10 голубой 11 розовый
                  (120, 60, 30, 255), (200, 130, 250, 255), (70, 250, 70, 255)]   # 12 коричневый 13 сиреневый 14 лайм

PANEL,BORDER,COUNTUR = 29*4, 20, 1.5

#####################################################################################
# Глобальные Переменные

WIN_WIDTH, WIN_HEIGHT = 470, 300
GAME = (WIN_WIDTH, WIN_HEIGHT)
HELP = (WIN_WIDTH/2, WIN_HEIGHT/2)
PHOTO = (WIN_WIDTH/2, WIN_HEIGHT/2)

fl_reset, show_hidden_circles, auto_marker, auto_marker_ring = False, False, 0, 0
resized, fl_resize = 0, False # 0 - нет, 1 - да, 2 - макс (не обрабатывается)
undo, moves, moves_stack, redo_stack, solved = False, 0, [], [], True



BTN_CLICK,BTN_CLICK_STR = False,""
dirname = filename = ""

#####################################################################################
# Глобальные Структуры данных

puzzle_display = dict()